In [14]:
#2021.06.02. WED
#Hankyeong

##CH04-7. 피봇테이블과 그룹분석
#00. 패키지 호출
import pandas as pd 
import numpy as np
import seaborn as sns

#01. .pivot() 메소드로 피봇만들기. 
data = {
    "도시": ["서울", "서울", "서울", "부산", "부산", "부산", "인천", "인천"],
    "연도": ["2015", "2010", "2005", "2015", "2010", "2005", "2015", "2010"],
    "인구": [9904312, 9631482, 9762546, 3448737, 3393191, 3512547, 2890451, 263203],
    "지역": ["수도권", "수도권", "수도권", "경상권", "경상권", "경상권", "수도권", "수도권"]
        }
columns = ["연도", "지역", "도시", "인구"]
df1 = pd.DataFrame(data, columns=columns)
df1

     연도   지역  도시       인구
0  2015  수도권  서울  9904312
1  2010  수도권  서울  9631482
2  2005  수도권  서울  9762546
3  2015  경상권  부산  3448737
4  2010  경상권  부산  3393191
5  2005  경상권  부산  3512547
6  2015  수도권  인천  2890451
7  2010  수도권  인천   263203

In [4]:
df1.pivot(index="도시",columns="연도",values="인구")

연도       2005       2010       2015
도시
부산  3512547.0  3393191.0  3448737.0
서울  9762546.0  9631482.0  9904312.0
인천        NaN   263203.0  2890451.0

In [9]:
#02. groupby() 메쏘드로 그룹분석하기.
#(1)
np.random.seed(0)
df2 = pd.DataFrame({
    'key1': ['A', 'A', 'B', 'B', 'A'],
    'key2': ['one', 'two', 'one', 'two', 'one'],
    'data1': [1, 2, 3, 4, 5],
    'data2': [10, 20, 30, 40, 50]
})
df2

  key1 key2  data1  data2
0    A  one      1     10
1    A  two      2     20
2    B  one      3     30
3    B  two      4     40
4    A  one      5     50

In [10]:
df2.groupby(df2["key1"]).sum()

      data1  data2
key1
A         8     80
B         7     70

In [11]:
df2.groupby(df2["key2"]).mean()

      data1  data2
key2
one       3     30
two       3     30

In [12]:
df2.groupby([df2["key1"],df2["key2"]]).sum()

           data1  data2
key1 key2
A    one       6     60
     two       2     20
B    one       3     30
     two       4     40

In [15]:
#(2) titanic 데이터셋으로 1등실에 탄 여성의 평균 나이 구하기.
titanic = sns.load_dataset("titanic")
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [55]:
titanic.groupby([titanic["class"],titanic["sex"]]).mean()["age"]

class   sex
First   female    34.611765
        male      41.281386
Second  female    28.722973
        male      30.740707
Third   female    21.750000
        male      26.507589
Name: age, dtype: float64

In [19]:
#(3) iris 데이터셋으로 사용자정의 함수를 이용해 그룹분석하기. 
iris = sns.load_dataset("iris")
iris

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [20]:
#①peak_to_peak_ratio
def peak_to_peak_ratio(x) :
    return x.max() / x.min()

In [21]:
iris.groupby(iris["species"]).agg(peak_to_peak_ratio)

            sepal_length  sepal_width  petal_length  petal_width
species
setosa          1.348837     1.913043      1.900000     6.000000
versicolor      1.428571     1.700000      1.700000     1.800000
virginica       1.612245     1.727273      1.533333     1.785714

In [22]:
#②max-min
iris.groupby(iris["species"]).agg(lambda x: max(x)-min(x))

            sepal_length  sepal_width  petal_length  petal_width
species
setosa               1.5          2.1           0.9          0.5
versicolor           2.1          1.4           2.1          0.8
virginica            3.0          1.6           2.4          1.1

In [32]:
#(4) tips 데이터셋으로 그룹분석하기. 
tips = sns.load_dataset("tips")
tips

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [73]:
tips["tip_pct"] = np.round(tips["tip"] / tips["total_bill"] * 100,2)
tips.head()

   total_bill   tip     sex smoker  day    time  size  tip_pct
0       16.99  1.01  Female     No  Sun  Dinner     2     5.94
1       10.34  1.66    Male     No  Sun  Dinner     3    16.05
2       21.01  3.50    Male     No  Sun  Dinner     3    16.66
3       23.68  3.31    Male     No  Sun  Dinner     2    13.98
4       24.59  3.61  Female     No  Sun  Dinner     4    14.68

In [43]:
#①groupby() 메쏘드를 이용해 성별 데이터 개수 파악하기.
tips.groupby(tips["sex"]).size()

sex
Male      157
Female     87
dtype: int64

In [42]:
#②groupby() 메쏘드를 이용해 성별과, 흡연 여부로 데이터 개수 파악하기.
tips.groupby([tips["sex"],tips["smoker"]]).size()

sex     smoker
Male    Yes       60
        No        97
Female  Yes       33
        No        54
dtype: int64

In [51]:
#③groupby() 메쏘드를 이용해 성별의 tip_pct 비율 알아보기.
tips.groupby("sex").mean()["tip_pct"]

sex
Male      15.764713
Female    16.648276
Name: tip_pct, dtype: float64

In [52]:
#④groupby() 메쏘드를 이용해 성별의 tip_pct 비율 알아보기.
tips.groupby("smoker").mean()["tip_pct"]

smoker
Yes    16.319140
No     15.932318
Name: tip_pct, dtype: float64

In [56]:
tips.groupby(["sex","smoker"]).mean()["tip_pct"]

sex     smoker
Male    Yes       15.276667
        No        16.066598
Female  Yes       18.214545
        No        15.691111
Name: tip_pct, dtype: float64

In [57]:
#03. pivot_table() 메쏘드 활용하기.
#(1) pvot() 메쏘드와 비교하기.
df1.pivot(index="도시",columns="연도",values="인구")

연도       2005       2010       2015
도시
부산  3512547.0  3393191.0  3448737.0
서울  9762546.0  9631482.0  9904312.0
인천        NaN   263203.0  2890451.0

In [58]:
df1.pivot_table(index="도시", columns="연도", values="인구", margins=True, margins_name="합계")

연도       2005       2010       2015            합계
도시
부산  3512547.0  3393191.0  3448737.0  3.451492e+06
서울  9762546.0  9631482.0  9904312.0  9.766113e+06
인천        NaN   263203.0  2890451.0  1.576827e+06
합계  6637546.5  4429292.0  5414500.0  5.350809e+06

In [60]:
#(2) tips 데이터로 pivot table 만들기. 
tips.pivot_table(index="sex",columns="smoker",values="tip_pct")

smoker        Yes         No
sex
Male    15.276667  16.066598
Female  18.214545  15.691111